config.org
**** Language Support
#+name: doom-lang
#+begin_src emacs-lisp
cc                           ; C/C++/Obj-C madness
clojure                      ; java with a lisp
common-lisp                  ; if you've seen one lisp, you've seen them all
data                         ; config/data formats
emacs-lisp                   ; drown in parentheses
(haskell +lsp)               ; a language that's lazier than I am
json                         ; At least it ain't XML
(javascript +lsp)            ; all(hope(abandon(ye(who(enter(here))))))
(julia +lsp)                 ; a better, faster MATLAB
(latex                       ; writing papers in Emacs has never been so fun
 +latexmk                    ; what else would you use?
 +cdlatex                    ; quick maths symbols
 +lsp                        ; Is serves a purpose
 +fold)                      ; fold the clutter away nicities
markdown                     ; writing docs for people to ignore
(org                         ; organize your plain life in plain text
 +pretty                     ; yessss my pretties! (nice unicode symbols)
 +dragndrop                  ; drag & drop files/images into org buffers
 +hugo                       ; use Emacs for hugo blogging
 +noter                      ; enhanced PDF notetaking
 +jupyter                    ; ipython/jupyter support for babel
 +pandoc                     ; export-with-pandoc support
 +gnuplot                    ; who doesn't like pretty pictures
 +present                    ; using org-mode for presentations
 +roam)                      ; wander around notes
(python                      ; beautiful is better than ugly
 +lsp                        ; Useless otherwise
 +pyright                    ; Because M$ makes good stuff sometimes
 +pyenv                      ; Unfucks python versioning
 +poetry)                    ; Unfucks python projects
rest                         ; Emacs as a REST client
(rust +lsp)                  ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
sh                           ; she sells {ba,z,fi}sh shells on the C xor
web                          ; the tubes
yaml                         ; JSON, but readable
#+end_src
**** Things that shouldn't be in emacs
#+name: doom-app
#+begin_src emacs-lisp
irc                          ; how neckbeards socialize
(rss +org)                   ; emacs as an RSS reader
#+end_src
**** Unfuck native comp
Unless this gets patched, the current build of native comp throws a ton of errors due to =obsolete-function-alias=. This patch kinda fixes it. A lot of old packages would need to be patched for this to be removable
#+name: doom-native-comp-patch
#+begin_src emacs-lisp
(define-advice define-obsolete-function-alias (:filter-args (ll) fix-obsolete)
  (let ((obsolete-name (pop ll))
        (current-name (pop ll))
        (when (if ll (pop ll) "1"))
        (docstring (if ll (pop ll) nil)))
    (list obsolete-name current-name when docstring)))
#+end_src
*** Visual Settings
**** Font
I use FiraCode because I like ligatures, but I have a unicode fallback to JuliaMono to give me monospaced unicode characters. JuliaMono has a TON, but no ligatures - so the default will be Fira.
#+begin_src emacs-lisp
(setq doom-font (font-spec :family "Fira Code Retina" :size 14)
      doom-unicode-font (font-spec :family "JuliaMono"))
#+end_src
**** Theme
Dracula is love. Dracula is life. Dracula all the things
#+begin_src emacs-lisp
(setq doom-theme 'doom-dracula)
#+end_src
**** Misc
I'll try relative line numbers, because Elijah said it was cool
#+begin_src emacs-lisp
(setq display-line-numbers-type 'relative)
#+end_src
Slightly nicer default buffer names
#+begin_src emacs-lisp
(setq doom-fallback-buffer-name "► Doom"
      +doom-dashboard-name "► Doom")
#+end_src
*** Babel in CLI
Copied from tecosaur, using doom's =cli.el= to clean up output and to allow for this file to be used in =doom sync=
#+begin_src emacs-lisp :tangle cli.el :comments none
;;; cli.el -*- lexical-binding: t; -*-
(setq org-confirm-babel-evaluate nil)

(defun doom-shut-up-a (orig-fn &rest args)
  (quiet! (apply orig-fn args)))

(advice-add 'org-babel-execute-src-block :around #'doom-shut-up-a)
#+end_src

* Packages
:PROPERTIES:
:header-args:emacs-lisp: :tangle "packages.el" :comments no
:END:
This file shouldn't be byte compiled.
#+begin_src emacs-lisp :tangle "packages.el" :comments no
;; -*- no-byte-compile: t; -*-
#+end_src
** General
*** Large Files
The /very large files/ mode loads large files in chunks, allowing one to open
ridiculously large files.
#+begin_src emacs-lisp
(package! vlf :recipe (:host github :repo "m00natic/vlfi" :files ("*.el"))
  :disable t)
#+end_src
To make VLF available without delaying startup, we'll just load it in quiet moments.
#+begin_src emacs-lisp :tangle yes
(use-package! vlf-setup
  :defer-incrementally vlf-tune vlf-base vlf-write vlf-search vlf-occur vlf-follow vlf-ediff vlf)
#+end_src
*** Parens
Both of these packages improve evil integration with structural editing
#+begin_src emacs-lisp
(package! evil-cleverparens)
(package! evil-smartparens)
#+end_src
** Languages
*** Org
**** Jupyter
Support exporting jupyter buffers as ipynbs
#+begin_src emacs-lisp
(package! ox-ipynb :recipe (:type git :host github :repo "jkitchin/ox-ipynb"))
#+end_src
**** Agenda/Capture
Trying out the "better" org agenda and "declarative org capture templates"
#+begin_src emacs-lisp
(package! org-super-agenda)
(package! doct :recipe (:host github :repo "progfolio/doct"))
#+end_src
**** Visuals
Make org tables look better
#+begin_src emacs-lisp
(package! org-pretty-table
  :recipe (:host github :repo "Fuco1/org-pretty-table"))
#+end_src
#+begin_src emacs-lisp :tangle yes
(use-package! org-pretty-table
  :commands (org-pretty-table-mode global-org-pretty-table-mode))
#+end_src
Auto-toggle latex fragment previews
#+begin_src emacs-lisp
(package! org-fragtog)
#+end_src
Pretty org markers
#+begin_src emacs-lisp
(package! org-appear :recipe (:host github :repo "awth13/org-appear"))
#+end_src
Pretty org section tags
#+begin_src emacs-lisp
(package! org-pretty-tags)
#+end_src
**** Academics
org-ref is a must
#+begin_src emacs-lisp
(package! org-ref)
#+end_src
Then all the things for org-roam
#+begin_src emacs-lisp
(package! org-roam-bibtex)
#+end_src
*** Systemd
For editing systemd unit files
#+begin_src emacs-lisp
(package! systemd)
#+end_src
*** Clojure
There were some bugs in native-comp building =clojure-mode= so I'm unpinning it to grab the upstream fix
#+begin_src emacs-lisp
(unpin! clojure-mode)
#+end_src
*** Web
Impatient mode is a nice way to quickly edit HTML files with a little local server
#+begin_src emacs-lisp
(package! impatient-mode)
#+end_src
#+begin_src emacs-lisp :tangle yes
(use-package! impatient-mode
  :defer t)
#+end_src

* Package Configuration
** Calc
Prefer radians in angle and exact values
#+begin_src emacs-lisp
(setq calc-angle-mode 'rad  ; radians are rad
      calc-symbolic-mode t) ; keeps expressions like \sqrt{2} irrational for as long as possible
#+end_src
** Emojis
Use twitter's emojis
#+begin_src emacs-lisp
(setq emojify-emoji-set "twemoji-v2")
#+end_src
But prefer the default characters in org mode
#+begin_src emacs-lisp
(defvar emojify-disabled-emojis
  '(;; Org
    "◼" "☑" "☸" "⚙" "⏩" "⏪" "⬆" "⬇" "❓"
    ;; Terminal powerline
    "✔"
    ;; Box drawing
    "▶" "◀")
  "Charachters that should never be affected by `emojify-mode'.")

(defadvice! emojify-delete-from-data ()
  "Ensure `emojify-disabled-emojis' don't appear in `emojify-emojis'."
  :after #'emojify-set-emoji-data
  (dolist (emoji emojify-disabled-emojis)
    (remhash emoji emojify-emojis)))
#+end_src
** Treemacs
Remove all the files that we don't care about
#+begin_src emacs-lisp
(after! treemacs
  (defvar treemacs-file-ignore-extensions '()
    "File extension which `treemacs-ignore-filter' will ensure are ignored")
  (defvar treemacs-file-ignore-globs '()
    "Globs which will are transformed to `treemacs-file-ignore-regexps' which `treemacs-ignore-filter' will ensure are ignored")
  (defvar treemacs-file-ignore-regexps '()
    "RegExps to be tested to ignore files, generated from `treeemacs-file-ignore-globs'")
  (defun treemacs-file-ignore-generate-regexps ()
    "Generate `treemacs-file-ignore-regexps' from `treemacs-file-ignore-globs'"
    (setq treemacs-file-ignore-regexps (mapcar 'dired-glob-regexp treemacs-file-ignore-globs)))
  (if (equal treemacs-file-ignore-globs '()) nil (treemacs-file-ignore-generate-regexps))
  (defun treemacs-ignore-filter (file full-path)
    "Ignore files specified by `treemacs-file-ignore-extensions', and `treemacs-file-ignore-regexps'"
    (or (member (file-name-extension file) treemacs-file-ignore-extensions)
        (let ((ignore-file nil))
          (dolist (regexp treemacs-file-ignore-regexps ignore-file)
            (setq ignore-file (or ignore-file (if (string-match-p regexp full-path) t nil)))))))
  (add-to-list 'treemacs-ignored-file-predicates #'treemacs-ignore-filter))
#+end_src

Now, we just identify the files in question.
#+begin_src emacs-lisp
(setq treemacs-file-ignore-extensions
      '(;; LaTeX
        "aux"
        "ptc"
        "fdb_latexmk"
        "fls"
        "synctex.gz"
        "toc"
        ;; LaTeX - glossary
        "glg"
        "glo"
        "gls"
        "glsdefs"
        "ist"
        "acn"
        "acr"
        "alg"
        ;; LaTeX - pgfplots
        "mw"
        ;; LaTeX - pdfx
        "pdfa.xmpi"
        ))
(setq treemacs-file-ignore-globs
      '(;; LaTeX
        "*/_minted-*"
        ;; AucTeX
        "*/.auctex-auto"
        "*/_region_.log"
        "*/_region_.tex"))
#+end_src
** Projectile
I want projectile to know where my projects are, and these are consistent across all my computers
#+begin_src emacs-lisp
(setq projectile-project-search-path `("~/Projects" "~/src"))
#+end_src
*** Reference Management
I'll hook up all the reference stuff, bibtex, reftex, org-ref, etc. all to where my bibliographies and PDFs of papers go
#+begin_src emacs-lisp
(setq-default
 reftex-default-bibliography '("~/Dropbox/Bibliographies/main.bib")
 org-ref-default-bibliography '("~/Dropbox/Bibliographies/main.bib")
 bibtex-completion-bibliography "~/Dropbox/Bibliographies/main.bib"
 bibtex-completion-library-path "~/Dropbox/Bibliographies/"
 org-ref-pdf-directory "~/Dropbox/Bibliographies/")
#+end_src
* Language Configuration
** Plaintext
Allow for ANSI color codes to be displayed
#+begin_src emacs-lisp
(after! text-mode
  (add-hook! 'text-mode-hook
             ;; Apply ANSI color codes
             (with-silent-modifications
               (ansi-color-apply-on-region (point-min) (point-max)))))
#+end_src
** Org
:PROPERTIES:
:CUSTOM_ID: org
:header-args:emacs-lisp: :tangle no :noweb-ref org-conf
:END:
There's gonna be a lot in here, so we'll tangle this in
#+begin_src emacs-lisp :noweb no-export :tangle yes :noweb-ref nil
(after! org
  <<org-conf>>
)
#+end_src
*** Behavior
**** Tweaking Defaults
#+begin_src emacs-lisp
(setq org-directory "~/.org"                      ; let's put files here
      org-use-property-inheritance t              ; it's convenient to have properties inherited
      org-log-done 'time                          ; having the time a item is done sounds convininet
      org-list-allow-alphabetical t               ; have a. A. a) A) list bullets
      org-export-in-background t                  ; run export processes in external emacs process
      org-catch-invisible-edits 'smart            ; try not to accidently do weird stuff in invisible regions
      org-export-with-sub-superscripts '{}        ; don't treat lone _ / ^ as sub/superscripts, require _{} / ^{}
      org-re-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js")
#+end_src
By default, ~visual-line-mode~ is turned =on=, and ~auto-fill-mode~ =off= by a hook.
However this messes with tables in Org-mode, and other plaintext files (e.g.
markdown, \LaTeX) so I'll turn it off for this, and manually enable it for more
specific modes as desired.
#+begin_src emacs-lisp
(remove-hook 'text-mode-hook #'visual-line-mode)
(add-hook 'text-mode-hook #'auto-fill-mode)
#+end_src
**** Citation
Setup org-ref
#+begin_src emacs-lisp
(use-package! org-ref
  :after org
  :config
  (setq org-ref-completion-library 'org-ref-ivy-cite))
#+end_src
