init.el
       cc                           ; C/C++/Obj-C madness
       clojure                      ; java with a lisp
       common-lisp                  ; if you've seen one lisp, you've seen them all
       data                         ; config/data formats
       emacs-lisp                   ; drown in parentheses
       (haskell +lsp)               ; a language that's lazier than I am
       json                         ; At least it ain't XML
       (javascript +lsp)            ; all(hope(abandon(ye(who(enter(here))))))
       (julia +lsp)                 ; a better, faster MATLAB
       (latex                       ; writing papers in Emacs has never been so fun
        +latexmk                    ; what else would you use?
        +cdlatex                    ; quick maths symbols
        +lsp                        ; Is serves a purpose
        +fold)                      ; fold the clutter away nicities
       markdown                     ; writing docs for people to ignore
       (org                         ; organize your plain life in plain text
        +pretty                     ; yessss my pretties! (nice unicode symbols)
        +dragndrop                  ; drag & drop files/images into org buffers
        +hugo                       ; use Emacs for hugo blogging
        +noter                      ; enhanced PDF notetaking
        +jupyter                    ; ipython/jupyter support for babel
        +pandoc                     ; export-with-pandoc support
        +gnuplot                    ; who doesn't like pretty pictures
        +present                    ; using org-mode for presentations
        +roam)                      ; wander around notes
       (python                      ; beautiful is better than ugly
        +lsp                        ; Useless otherwise
        +pyright                    ; Because M$ makes good stuff sometimes
        +pyenv                      ; Unfucks python versioning
        +poetry)                    ; Unfucks python projects
       rest                         ; Emacs as a REST client
       (rust +lsp)                  ; Fe2O3.unwrap().unwrap().unwrap().unwrap()
       sh                           ; she sells {ba,z,fi}sh shells on the C xor
       web                          ; the tubes
       yaml                         ; JSON, but readable
       :app
       irc                          ; how neckbeards socialize
       (rss +org)                   ; emacs as an RSS reader
       :config
       literate
       (default +bindings +smartparens)
       )
(define-advice define-obsolete-function-alias (:filter-args (ll) fix-obsolete)
  (let ((obsolete-name (pop ll))
        (current-name (pop ll))
        (when (if ll (pop ll) "1"))
        (docstring (if ll (pop ll) nil)))
    (list obsolete-name current-name when docstring)))
